package com.example.topographicmaps;

public class Strings {
    String values1 = "   Военная топография — дисциплина военного дела, изучающая методы и " +
            "средства оценки местности, ориентирования на местности и осуществления полевых " +
            "измерений для обеспечения боевой деятельности войск (сил), определяющая правила по " +
            "ведению рабочих карт командиров и разработки графических боевых документов\n" +
            "   Военная топография является особым разделом топографии, приспособленной для нужд вооружённых сил.\n" +
            "   Отличия топографии, применяемой в гражданской сфере, от топографии военной " +
            "заключаются в первую очередь в разном подходе к принципам картографии.";


    public String getValuesForOfficer() {
        return valuesForOfficer;
    }

    public String getValuesForSoldier() {
        return valuesForSoldier;
    }

    String valuesForOfficer = "    Выпускник должен обладать следующей военно-профессиональной компетенцией:\n" +
            "  способностью оценивать элементы по карте, выполнять измерения по ней, отображать на рабочей карте" +
            "результаты изучения местности, наносить обстановку, ориентироватся на местности по карте и без нее\n" +
            "Составляющие военно-профессиональной компетенции:\n" +
            "   Знать:\n" +
            "   - Способы измерений и ориентирования на местности по карте и без карты;\n" +
            "   - Раздновидности и тактичсеские свойства местности, их влияние на действия подразделений " +
            "в боевой обстановке;\n" +
            "   - Назначение и содержание, разграфку и номенклатуру, условные знаки топографических карт;\n" +
            "   - Классификацию и изображение на картах элементов метсности;\n" +
            "   - Точнсть измерения расстояний по карте;\n" +
            "   - Способы измерений и ориентирования на метсности по карте;\n" +
            "   - Правила оформления и порядок ведения рабочей карты командира.\n" +
            "   Уметь:\n" +
            "   - Состовлять заявки на топографические карты по сборной таблице на район действия подразделения;\n" +
            "   - Читать карты различных масштабови выполнять измерения по ним;\n" +
            "   - Выполнять оценку элементов местности по карте, выполнить измерения по карте;\n" +
            "   - Определить расстояние, протяженность маршшрута и координаты объетков по карте;\n" +
            "   - Ориентироваться на местности по карте и без нее;\n" +
            "   - Отображать на рабочей карте результаты изучения местности, наносить обстановку.\n" +
            "   Владеть:\n" +
            "   - Умением читать условные знаки топографических карт РФ;\n" +
            "   - Навыками ориентирования на метсности без карты и по карте;\n" +
            "   - Способами измерения расстояний на топографической карте и местности;\n" +
            "   - Методами определния координат точек местности и объектов по топографической карте;\n" +
            "   - Основными правилами ведения рабочей карты командира;\n" +
            "   - Приемами нанесения на карту целей, ориентиров, элементов боевых порядков.\n";


    String valuesForSoldier = "    Выпускник должен обладать следующей военно-профессиональной компетенцией:\n" +
            "  способностью оценивать элементы по карте, выполнять измерения по ней, отображать на рабочей карте" +
            "результаты изучения местности, наносить обстановку, ориентироватся на местности по карте и без нее\n" +
            "Составляющие военно-профессиональной компетенции:\n" +
            "   Знать:\n" +
            "   - Способы измерений и ориентирования на местности по карте и без карты;\n" +
            "   - Правила ориентирования на метсности и без карты.\n" +
            "   Уметь:\n" +
            "   - Определять по топографической карте координаты объектов;\n" +
            "   - Ориентироватся на местности.\n" +
            "   Владеть:\n" +
            "   - Навыками ориентирования на метсности.";


    String bold1 = "    Военная топография";
    String bold2 = "    Принципы картографии";
    String values2 = "  Если в топографии, применяемой в гражданской сфере, построение карт основано" +
            " на применении системы географических координат земной поверхности, то в военной топографии" +
            " применяется в основном система прямоугольных координат.\n" +
            "Внешне карты для гражданского применения и военные карты отображают одинаковую" +
            " информацию о расположении географических объектов (контуры населённых пунктов," +
            " расстояния между географическими объектами и т. д.). Разница заключается в системе" +
            " координат, которыми отмечена карта.\n" +
            "   Для географических карт, для обозначения какого-либо места на земной поверхности" +
            " применяется угловая координатная система долготы и широты, в которой отражена" +
            " сферическая поверхность Земли. Любая точка на поверхности земли в ней отчитывается" +
            " в угловых координатах относительно точки пересечения нулевого меридиана" +
            " (меридиан Гринвича) с экватором.\n" +
            "   В военной картографии вся земная поверхность условно разбита на прямоугольники" +
            " определённых размеров — так называемая прямоугольная система координат или" +
            " Система координат Гаусса—Крюгера. Местоположение точки на земной поверхности" +
            " в ней отсчитывается как в Декартовой системе координат.";
}

