package com.example.topographicmaps;

public class Strings {
    String values1 = "   Военная топография — дисциплина военного дела, изучающая методы и " +
            "средства оценки местности, ориентирования на местности и осуществления полевых " +
            "измерений для обеспечения боевой деятельности войск (сил), определяющая правила по " +
            "ведению рабочих карт командиров и разработки графических боевых документов\n" +
            "   Военная топография является особым разделом топографии, приспособленной для нужд вооружённых сил.\n" +
            "   Отличия топографии, применяемой в гражданской сфере, от топографии военной " +
            "заключаются в первую очередь в разном подходе к принципам картографии.";
    String bold1 = "    Военная топография";
    String bold2 = "    Принципы картографии";
    String values2 = "  Если в топографии, применяемой в гражданской сфере, построение карт основано" +
            " на применении системы географических координат земной поверхности, то в военной топографии" +
            " применяется в основном система прямоугольных координат.\n" +
            "Внешне карты для гражданского применения и военные карты отображают одинаковую" +
            " информацию о расположении географических объектов (контуры населённых пунктов," +
            " расстояния между географическими объектами и т. д.). Разница заключается в системе" +
            " координат, которыми отмечена карта.\n" +
            "   Для географических карт, для обозначения какого-либо места на земной поверхности" +
            " применяется угловая координатная система долготы и широты, в которой отражена" +
            " сферическая поверхность Земли. Любая точка на поверхности земли в ней отчитывается" +
            " в угловых координатах относительно точки пересечения нулевого меридиана" +
            " (меридиан Гринвича) с экватором.\n" +
            "   В военной картографии вся земная поверхность условно разбита на прямоугольники" +
            " определённых размеров — так называемая прямоугольная система координат или" +
            " Система координат Гаусса—Крюгера. Местоположение точки на земной поверхности" +
            " в ней отсчитывается как в Декартовой системе координат.";
}

