package com.example.topographicmaps;

public class Strings {
    String values = "   Самое эффективное оружие – это не танки и артиллерия, а умение планировать " +
            "боевые действия таким образом, чтобы достичь максимального результата, не потеряв " +
            "при этом ни людей, ни технику. Любой, даже локальный, бой необходимо контролировать, " +
            "обеспечивая превосходство над противником, даже если силы неравны. Именно этому и " +
            "учит программа тактической подготовки.\n\n" +
            "   Обучение тактике состоит из теоретических и практических занятий, на которых, " +
            "овладев определенным багажом знаний, личный состав пытается выстроить ход боя. " +
            "Они должны:\n\n      - знать теоретические основы общевойскового боя;\n     - уметь " +
            "прогнозировать ситуацию в краткосрочной и долгосрочной перспективе;\n      - научиться " +
            "координации и четко понимать технические возможности группы;\n      - действовать " +
            "выдержанно, с минимальным риском для военнослужащих, и стараться выполнить " +
            "поставленную задачу.\n\n   Тактическая подготовка дает и дополнительную мотивацию " +
            "для дальнейшей службы в армии, прививает уважение к своему делу, " +
            "формирует высокие моральные, боевые и психологические качества.\n\n    После закрепления " +
            "основ начинается " +
            "практическая подготовка в условиях, максимально приближенных к боевым. " +
            "Используется как тяжелая техника (танки, БРТ), так и стрелковое оружие. " +
            "Военнослужащие должны мгновенно реагировать на изменение ситуации, четко следовать " +
            "приказам и работать в команде, координируя свои действия с другими.\n\n    Для старшего " +
            "личного состава проводятся дополнительные лекции и семинары, обучающие как " +
            "эффективному руководству группой, так и созданию оптимального психологического " +
            "и морального настроя у солдат.";
}
